import ast
import json
import re
from typing import List

from app.common.stand_log import StandLogger
from app.common.structs import RetrieverBlock
from app.logic.file_service import file_service
from app.logic.retriever.AS_doc.retrival_logic import Retrival


def parse_debug_result(text):
    '''
    从 LLM块 的返回信息中去掉debug信息，只保留答案信息
    并汇总 token 使用情况。

    Returns:
        answer_text: 答案信息。
        usage: 总共消耗的token信息

    Example:
        >>> text = """<status_>Querying<_status>
        ... <status_>Thingking<_status>
        ... <status_>Thingking Result: 图谱召回的结果中包含了张三的信息，可以直接从图谱召回的结果中找到答案。<_status>
        ... <status_>Finished<_status>
        ... <answer_>张三的职位是前端开发。<_answer>
        ... <usage_>{'prompt_tokens': 865, 'total_tokens': 897, 'completion_tokens': 32}<_usage>
        ... """  # stream=True 未调用工具
        >>> print(parse_debug_result(text))
        ('张三的职位是前端开发。', {'prompt_tokens': 865, 'total_tokens': 897, 'completion_tokens': 32})

        >>> text = """<status_>Querying<_status>
        ... <status_>Thingking<_status>
        ... <status_>Thingking Result: 在图谱召回的结果中，没有找到关于李四的信息。需要调用工具来获取李四的职位信息。<_status>
        ... <usage_>{'prompt_tokens': 865, 'total_tokens': 1378, 'completion_tokens': 513}<_usage>
        ... <status_>Tool Calling: NL2NGQL<_status>
        ... <status_>Thingking<_status>
        ... <status_>Thingking Result: 我已经知道最终答案了<_status>
        ... <status_>Finished<_status>
        ... <answer_>李四的职位是后端开发。<_answer>
        ... <usage_>{'prompt_tokens': 1415, 'total_tokens': 1435, 'completion_tokens': 20}<_usage>
        ... """  # stream=True 调用了工具
        >>> print(parse_debug_result(text))
        ('李四的职位是后端开发。', {'prompt_tokens': 2280, 'total_tokens': 2813, 'completion_tokens': 533})

        >>> text = """<status_>Querying<_status>
        ... <status_>Thingking<_status>
        ... <status_>Thingking Result: 图谱召回的结果中包含了张三的信息，可以直接从中获取答案。<_status>
        ... <usage_>{'prompt_tokens': 878, 'total_tokens': 908, 'completion_tokens': 30}<_usage>
        ... <status_>Finished<_status>
        ... <answer_>张三的职位是前端开发。<_answer>
        ... """  # stream=False 未调用工具
        >>> print(parse_debug_result(text))
        ('张三的职位是前端开发。', {'prompt_tokens': 878, 'total_tokens': 908, 'completion_tokens': 30})

        >>> text = """<status_>Querying<_status>
        ... <status_>Thingking<_status>
        ... <status_>Thingking Result: 在图谱召回的结果中，没有找到关于李四的信息。因此，不能直接从图谱召回的结果中回答用户的问题。<_status>
        ... <usage_>{'prompt_tokens': 878, 'total_tokens': 1397, 'completion_tokens': 519}<_usage>
        ... <status_>Tool Calling: NL2NGQL<_status>
        ... <status_>Thingking<_status>
        ... <status_>Thingking Result: 我已经知道最终答案了<_status>
        ... <usage_>{'prompt_tokens': 1430, 'total_tokens': 1454, 'completion_tokens': 24}<_usage>
        ... <status_>Finished<_status>
        ... <answer_>李四的职位是后端开发。<_answer>
        ... """  # stream=False 调用了工具
        >>> print(parse_debug_result(text))
        ('李四的职位是后端开发。', {'prompt_tokens': 2308, 'total_tokens': 2851, 'completion_tokens': 543})

        >>> text = """<answer_>引用参考文档的ID为[1]、[2]、[3]。
        ...
        ... 根据参考文档的内容，从节约成本的角度考虑，推荐使用铝合金模板。虽然铝合金模板的单次材料费用高于木模板，但其至少300次的周转率、接近0的损耗率和80%以上的标准化率，使得在建筑层数较高时，铝合金模板具有较大的成本优势。以一栋100米33层的高层建筑为例，铝合金模板的成本对比木模板有明显优势。铝合金模板的残值回收率高达30%，在高层或超高层建筑的使用中相比木模板体系有明显的成本优势。
        ...
        ... 因此，从节约成本的角度考虑，推荐使用铝合金模板。<_answer>
        ... <usage_>{'prompt_tokens': 961, 'total_tokens': 1113, 'completion_tokens': 152}<_usage>
        ... """  # simple_chat
        >>> assert parse_debug_result(text) == ("""引用参考文档的ID为[1]、[2]、[3]。
        ...
        ... 根据参考文档的内容，从节约成本的角度考虑，推荐使用铝合金模板。虽然铝合金模板的单次材料费用高于木模板，但其至少300次的周转率、接近0的损耗率和80%以上的标准化率，使得在建筑层数较高时，铝合金模板具有较大的成本优势。以一栋100米33层的高层建筑为例，铝合金模板的成本对比木模板有明显优势。铝合金模板的残值回收率高达30%，在高层或超高层建筑的使用中相比木模板体系有明显的成本优势。
        ...
        ... 因此，从节约成本的角度考虑，推荐使用铝合金模板。""", {'prompt_tokens': 961, 'total_tokens': 1113, 'completion_tokens': 152})
    '''
    if "<_answer>" in text:
        answer_pattern = re.compile(r"<answer_>([\s\S]*?)<_answer>")
    else:
        answer_pattern = re.compile(r"<answer_>([\s\S]*)")
    usage_pattern = re.compile(r"<usage_>({.+?})<_usage>")

    # 找到所有匹配的答案和使用情况
    answers = answer_pattern.findall(text)
    usages = usage_pattern.findall(text)

    # 初始化答案和使用情况的字典
    answer_text = ""
    usage = {"prompt_tokens": 0, "total_tokens": 0, "completion_tokens": 0}

    # 累加所有找到的使用情况
    for usage_str in usages:
        usage_data = ast.literal_eval(usage_str)  # 使用eval将字符串转换为字典
        usage["prompt_tokens"] += usage_data.get("prompt_tokens", 0)
        usage["total_tokens"] += usage_data.get("total_tokens", 0)
        usage["completion_tokens"] += usage_data.get("completion_tokens", 0)

    # 答案信息为最后一个匹配到的答案
    if answers:
        answer_text = answers[-1]

    return answer_text, usage


async def get_real_value(
    var_name: str,
    context: dict,
    to_string=False,
    truncate=False,
    max_length=int(32768 / 4 * 1.5),
    headers=None,
):
    """
    处理逻辑块的输出结果

    Args:
        var_name: 变量名称
        context: 全局变量信息
        to_string: 将结果转为字符串
        truncate: 召回块的结果用于LLM，需要截断
        max_length: 返回文本的最大长度，超过则截断
        headers: 请求头
    Returns:
        text: 输出结果
        max_length: 剩余的max_length
    """
    variable_pool = context.get("variables", {})
    variables_info = context.get("variables_info", {})
    if "." not in var_name:
        value = variable_pool.get(var_name)
        if (
            variables_info.get(var_name, {}).get("block_type") == "retriever_block"
            and truncate
        ):
            if value.get("text"):
                return _get_doc_retriever_output(value["text"], max_length)
            else:
                if "text" in value:
                    del value["text"]
                _remove_meta(value)
        if (
            variables_info.get(var_name, {}).get("block_type") == "llm_block"
            and variables_info.get(var_name, {}).get("llm_block_mode") != "expert"
        ):
            value = value.get("answer")
        if variables_info.get(var_name, {}).get("type") == "file":
            StandLogger.info_log("开始获取文件内容")
            value = ""
            if headers is None:
                headers = {}
            file_infos = context.get("variables", {}).get(var_name) or []
            # 获取文件内容
            await file_service.get_file_content(file_infos, headers)
            # 更新至context
            context["variables"][var_name] = file_infos
            as_file_over_length = False
            as_file_length = 0
            for file_info in file_infos:
                if len(value) >= max_length:
                    StandLogger.info_log(
                        f"文件内容超出上下文长度，停止添加, 剩余长度llm_context_size为{max_length}"
                    )
                    break
                if file_info.get("file_source") == "as":
                    for doc in file_info.get("fields") or []:
                        if len(value) >= max_length:
                            as_file_over_length = True
                            StandLogger.info_log(
                                f"文件内容超出上下文长度，停止添加, 剩余长度llm_context_size为{max_length}"
                            )
                            break
                        doc_name = doc["name"]
                        file_content = doc["content"]
                        if len(value) + len(file_content) > max_length:
                            file_content = file_content[
                                : max(max_length - len(value), 0)
                            ]
                        add_value = f"文件《{doc_name}》的内容为：\n{file_content}\n"
                        value += add_value
                        max_length -= len(add_value)
                        StandLogger.info_log(
                            f"llm_context_size减少文件长度，现在为{max_length}"
                        )
                elif file_info.get("file_source") == "local":
                    doc_name = file_info.get("name")
                    file_content = file_info.get("content")
                    if len(value) + len(file_content) > max_length:
                        file_content = file_content[: max(max_length - len(value), 0)]
                    add_value = f"文件《{doc_name}》的内容为：\n{file_content}\n"
                    value += add_value
                    max_length -= len(add_value)
                    StandLogger.info_log(
                        f"llm_context_size减少文件长度，现在为{max_length}"
                    )

                if as_file_over_length:
                    value_temp, llm_context_size_temp = await get_as_slices(
                        var_name, context, max_length + len(value), headers
                    )
                    if len(value_temp) == 0:
                        StandLogger.info_log(
                            "未获取到AS切片内容，获取全文内容进行截断处理"
                        )
                    else:
                        value = value_temp
                        max_length = llm_context_size_temp
                        StandLogger.info_log(
                            f"llm_context_size减少AS文件长度，现在为{max_length}"
                        )

                StandLogger.info_log("获取文件内容结束")
        if var_name == "query":
            query_process = context.get("query_process", {})
            current_query_process = query_process.get(var_name, {})
            if current_query_process.get("rewrite_query"):
                value = current_query_process.get("rewrite_query")
            elif current_query_process.get("augment_query"):
                value = current_query_process.get("augment_query")
            else:
                value = current_query_process.get("origin_query", value)
    else:
        var_name, *fields = var_name.split(".")
        value = variable_pool.get(var_name)
        if variables_info.get(var_name, {}).get("block_type") == "retriever_block":
            field = fields[0]
            if truncate:
                if field == "text":
                    return _get_doc_retriever_output(value["text"], max_length)
                else:
                    if "text" in value:
                        del value["text"]
                    _remove_meta(value)
            else:
                if field == "meta":
                    fields = ["text", "meta"] + fields[1:]
                value = traverse_nested_dict(value, fields)
        elif variables_info.get(var_name, {}).get("type") == "file":
            if value.get("file_source") == "as":
                new_value = []
                for ds in value:
                    new_value.extend(ds["fields"])
                value = new_value
            value = traverse_nested_dict(value, fields)
        else:
            value = traverse_nested_dict(value, fields)
    if to_string and not isinstance(value, str):
        return json.dumps(value, ensure_ascii=False), max_length
    return value, max_length


def _get_doc_retriever_output(text: List[dict], max_length=int(32768 / 4 * 1.5)):
    """
    处理文本召回的结果： 按照score排序后拼接content
    Returns:
        text: 处理后的文本
        max_length: 剩余的max_length
    """
    # 根据score值对列表进行排序
    sorted_text = sorted(text, key=lambda x: x.get("score", 0), reverse=True)

    # 构建排序后的输出字符串
    sorted_output = ""
    for index, item in enumerate(sorted_text, start=1):
        content = f"第{index}个参考信息 {item.get('meta', {}).get('doc_name', '')} -- {item['content']}\n-----\n"
        if len(sorted_output + content) >= max_length:
            sorted_output += content
            sorted_output = sorted_output[: max(max_length, 0)]
            max_length -= len(sorted_output)
            break
        sorted_output += content
        max_length -= len(content)
    return sorted_output.strip(), max_length


def _remove_meta(item):
    """
    处理 KBQA 召回的结果：删除meta
    """
    if isinstance(item, dict):  # 检查是否是字典
        if "meta" in item:  # 如果字典中有'meta'键，则删除它
            del item["meta"]
        for key, value in item.items():  # 递归处理字典中的每个值
            _remove_meta(value)
    elif isinstance(item, list):  # 检查是否是列表
        for element in item:
            _remove_meta(element)  # 递归处理列表中的每个元素


def get_value_by_key(value, key):
    """
    将 key 按点号分割成键路径列表

    Example:
        >>> value1 = {'a': {'b': {'c': 1}}}
        >>> key1 = "a.b.c"
        >>> print(get_value_by_key(value1, key1))
        1

        >>> value2 = {'a': {'b': {'c': 1}}}
        >>> key2 = "a.b"
        >>> print(get_value_by_key(value2, key2))
        {'c': 1}

        >>> value3 = [{'a': {'b': {'c': 1}}}]
        >>> key3 = "a.b"
        >>> print(get_value_by_key(value3, key3))
        [{'c': 1}]
    """
    keys = key.split(".")
    # 调用辅助函数并返回结果
    result = traverse_nested_dict(value, keys)
    return result


def traverse_nested_dict(data: dict, path: list):
    """遍历嵌套字典"""
    # 如果路径为空，返回当前数据
    if not path:
        return data
    # 获取当前路径的下一个键
    current_key = path[0]
    if not current_key:
        return traverse_nested_dict(data, path[1:])

    if isinstance(data, list):
        return [traverse_nested_dict(item, path) for item in data]
    elif isinstance(data, dict):
        if current_key in data:
            return traverse_nested_dict(data[current_key], path[1:])
        else:
            raise KeyError(f"'{current_key}'")
    else:
        raise KeyError(f"'{current_key}'")


async def get_as_slices(var_name, context, max_length, headers):
    StandLogger.info("AS文件长度过长，获取AS文件分片信息")
    query_process = context.get("query_process", {})

    retrival_config_input = {}

    current_query_process = query_process.get("query", {})
    if "origin_query" not in retrival_config_input:
        retrival_config_input["origin_query"] = ""
    retrival_config_input["origin_query"] += (
        current_query_process.get("origin_query", "") + " "
    )
    if current_query_process.get("rewrite_query"):
        if "rewrite_query" not in retrival_config_input:
            retrival_config_input["rewrite_query"] = ""
        retrival_config_input["rewrite_query"] += (
            current_query_process.get("rewrite_query") + " "
        )
    if current_query_process.get("augment_query"):
        if "augment_query" not in retrival_config_input:
            retrival_config_input["augment_query"] = ""
        retrival_config_input["augment_query"] += (
            current_query_process.get("augment_query") + " "
        )

    retrival_config_data_source = {"doc": []}
    file_infos = context.get("variables", {}).get(var_name)
    for file_info in file_infos:
        retrival_config_data_source["doc"].append(file_info)

    retrival_config = RetrieverBlock()
    retrival_config.headers_info = headers
    retrival_config.input = retrival_config_input
    retrival_config.data_source = retrival_config_data_source
    retrival_config.augment_data_source = {"concepts": [{"kg_id": "", "entities": []}]}
    advanced_config = {}

    StandLogger.debug("retrival_config = {}".format(retrival_config.__dict__))
    StandLogger.debug("advanced_config = {}".format(advanced_config))

    retrival = Retrival(advanced_config)
    retrival_response = await retrival.ado_retrival(retrival_config=retrival_config)

    # 根据score值对列表进行排序
    sorted_text = sorted(
        retrival_response, key=lambda x: x.get("score", 0), reverse=True
    )

    # 构建排序后的输出字符串
    references = []
    used_length = 0
    for index, item in enumerate(sorted_text, start=1):
        content = f"文件《{item.get('meta').get('doc_name', '')}》的内容为：\n{item['content']}"
        if used_length + len(content) >= max_length:
            content = content[: max(max_length - used_length, 0)]
            references.append(content)
            max_length -= len(content)
            break
        else:
            used_length += len(content)
            references.append(content)
            max_length -= len(content)
    value = "\n".join([f"{i}" for i in references])
    StandLogger.info("获取AS文件分片信息结束")
    return value, max_length


if __name__ == "__main__":
    text = [
        {
            "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600292|远达环保|主板A股|5.09|0.083|0.39|108100|5396.64|4.7|4.75|5.09|4.75\n600239|云南城投|主板A股|2.02|0.0466|0.09|192190|3846.55|1.93|1.93|2.03|1.93\n600096|云天化|主板A股|21.05|0.0248|0.51|458284|95004.73|20.54|20.58|21.1|20.3\n688031|星环科技-U|科创板|41.27|0.0223|0.9|10573|4248.66|40.37|40.8|41.27|39.12\n600192|长城电工|主板A股|4.08|0.0382|0.15|126023|5080.81|3.93|3.8|4.17|3.75\n600148|长春一东|主板A股|12.3|0.0789|0.9|39566|4790.29|11.4|11.44|12.35|11.44\n688037|芯源微|科创板|106.97|0.0286|2.97|28120|30271.4|104|103.01|110.99|103.01\n600119|长江投资|主板A股|6.37|0.046|0.28|174318|10951.59|6.09|5.91|6.45|5.91\n600036|招商银行|主板A股|33.3|0.0168|0.55|948212|313120.21|32.75|32.69|33.49|32.47\n600120|浙江东方|主板A股|3.74|0.0275|0.1|220834|8172.76|3.64|3.65|3.74|3.65\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600113|浙江东日|主板A股|7.37|0.0728|0.5|74802|5449.74|6.87|7.1|7.43|6.98\n600032|浙江新能|主板A股|7.34|0.0715|0.49|134898|9669.34|6.85|6.9|7.35|6.88\n600216|浙江医药|主板A股|9.33|0.0021|0.02|161731|15023.06|9.31|9.32|9.43|9.17\n600023|浙能电力|主板A股|6.66|0.0076|0.05|474603|31358.38|6.61|6.6|6.67|6.51\n688058|宝兰德|科创板|31.78|0.0332|1.02|2529|786.81|30.76|31.3|32.02|30.4\n600121|郑州煤电|主板A股|3.59|0.0346|0.12|258447|9210.14|3.47|3.4|3.65|3.4\n600072|中船科技|主板A股|16.09|0.0301|0.47|244737|38870.16|15.62|15.42|16.09|15.25\n688691|灿芯股份|科创板|48.13|0.0351|1.63|25877|12015.26|46.5|46.06|48.5|44.88\n600150|中国船舶|主板A股|39.37|0.0189|0.73|463410|180157.45|38.64|38.48|39.42|37.65\n600115|中国东航|主板A股|3.5|0.0264|0.09|627325|21705.39|3.41|3.4|3.5|3.4\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600007|中国国贸|主板A股|23.18|0.0198|0.45|35182|8082.85|22.73|22.52|23.27|22.48\n600176|中国巨石|主板A股|11.36|0.0216|0.24|837532|93862.79|11.12|11.07|11.44|10.95\n600050|中国联通|主板A股|4.82|0.019|0.09|3238613|153786.37|4.73|4.71|4.83|4.64\n600028|中国石化|主板A股|6.64|-0.006|-0.04|1910952|125816.72|6.68|6.64|6.65|6.48\n600118|中国卫星|主板A股|24.16|0.0203|0.48|106038|25464.21|23.68|23.69|24.27|23.66\n600056|中国医药|主板A股|11.31|0.0217|0.24|335536|37320.77|11.07|10.83|11.44|10.68\n600252|中恒集团|主板A股|2.27|0.0271|0.06|388597|8716.12|2.21|2.22|2.27|2.22\n688696|极米科技|科创板|83.76|0.0406|3.27|2756|2268.93|80.49|80.34|83.88|80.06\n900936|鄂资Ｂ股|主板B股|1.04|0.0146|0.02|12704|132.05|1.02|1.03|1.05|1.02\n600163|中闽能源|主板A股|4.42|0.0184|0.08|169756|7450.68|4.34|4.29|4.43|4.29\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600195|中牧股份|主板A股|8.5|0.0316|0.26|122529|10375.52|8.24|8.33|8.57|8.32\n600138|中青旅|主板A股|12.06|0.0644|0.73|827017|97173.37|11.33|11.17|12.16|11.09\n600088|中视传媒|主板A股|22.15|0.0518|1.09|440837|94258.91|21.06|21.23|22.24|19.89\n600158|中体产业|主板A股|8.33|0.0518|0.41|156896|12875.3|7.92|7.99|8.34|7.97\n600084|中信尼雅|主板A股|6|0.0714|0.4|50280|2980.99|5.6|5.7|6.1|5.69\n600030|中信证券|主板A股|18.1|0.0267|0.47|1205475|214569.53|17.63|17.58|18.11|17.45\n688697|纽威数控|科创板|19.59|0.0437|0.82|25365|4887.22|18.77|18.85|19.87|18.61\n600020|中原高速|主板A股|3.89|0.0346|0.13|224542|8634.3|3.76|3.79|3.92|3.78\n600026|中远海能|主板A股|16.22|0.0253|0.4|246187|39418.21|15.82|15.8|16.22|15.52\n600217|中再资环|主板A股|4.7|0.0586|0.26|184423|8524.93|4.44|4.47|4.7|4.47\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600038|中直股份|主板A股|40.35|0.0652|2.47|133779|52881.7|37.88|38.28|40.39|38.07\n688059|华锐精密|科创板|64.17|0.0731|4.37|6508|4130.69|59.8|61.5|65.58|61.5\n600106|重庆路桥|主板A股|5.82|0.062|0.34|224940|12932.85|5.48|5.6|5.84|5.58\n600132|重庆啤酒|主板A股|65.5|0.0043|0.28|42703|27998.82|65.22|65.04|66.26|65.02\n688050|爱博医疗|科创板|140|0.1182|14.8|20072|27992.69|125.2|140|143|136.65\n600225|卓朗科技|主板A股|2.59|0.1021|0.24|213742|5406.92|2.35|2.42|2.59|2.4\n600210|紫江企业|主板A股|5.92|0.1004|0.54|1234603|72284.41|5.38|5.55|5.92|5.55\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12688049|炬芯科技|科创板|24.64|0.0008|0.02|9003|2193.31|24.62|24.59|24.7|24.07\n600101|明星电力|主板A股|7.99|0.039|0.3|124096|9836.54|7.69|7.8|8.03|7.76\n688693|锴威特|科创板|22.35|0.0009|0.02|3255|712.77|22.33|22.32|22.45|21.52\n688046|药康生物|科创板|11.49|0.0009|0.01|11245|1279|11.48|11.59|11.59|11.17\n600029|南方航空|主板A股|5.51|0.0147|0.08|385190|21049.08|5.43|5.46|5.51|5.43\n600064|南京高科|主板A股|6.58|0.0092|0.06|205855|13434.53|6.52|6.5|6.58|6.47\n600250|南京商旅|主板A股|8.58|-0.0194|-0.17|309898|26924.82|8.75|7.92|9.12|7.92\n600219|南山铝业|主板A股|3.6|0.0286|0.1|1090280|38721.87|3.5|3.51|3.61|3.5\n600051|宁波联合|主板A股|5.77|0.0765|0.41|62509|3571.21|5.36|5.49|5.83|5.49\n688060|云涌科技|科创板|27.79|0.0011|0.03|1007|275.26|27.76|27.82|27.95|26.93\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600110|诺德股份|主板A股|4.35|0.0741|0.3|247197|10576|4.05|4.1|4.35|4.1\n600215|派斯林|主板A股|8.32|0.0667|0.52|104055|8602.43|7.8|7.97|8.42|7.97\n600000|浦发银行|主板A股|7.34|0.011|0.08|431519|31410.21|7.26|7.26|7.35|7.18\n688711|宏微科技|科创板|25.85|0.0035|0.09|14747|3757.93|25.76|25.65|26.05|25.05\n600243|青海华鼎|主板A股|3.52|0.0414|0.14|277505|9532.63|3.38|3.05|3.55|3.05\n600103|青山纸业|主板A股|2.09|0.0556|0.11|339767|6982.44|1.98|1.98|2.09|1.98\n600218|全柴动力|主板A股|7.53|0.0897|0.62|126374|9321.07|6.91|7.07|7.53|7.03\n600189|泉阳泉|主板A股|7.78|0.0821|0.59|200507|15036.71|7.19|7.1|7.79|7.06\n600079|人福医药|主板A股|19.82|0.0269|0.52|254010|49700.73|19.3|19.3|19.85|18.98\n600017|日照港|主板A股|2.87|0.0287|0.08|356999|10112.96|2.79|2.79|2.87|2.79\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600180|瑞茂通|主板A股|4.82|0.1005|0.44|175929|8243.77|4.38|4.45|4.82|4.44\n900911|金桥Ｂ股|主板B股|0.92|0.0033|None|1005|9.25|0.92|0.92|0.93|0.92\n600116|三峡水利|主板A股|7.27|0.0254|0.18|139591|10086.25|7.09|7.2|7.28|7.12\n600293|三峡新材|主板A股|2.68|0.0635|0.16|168752|4455.09|2.52|2.55|2.68|2.55\n600031|三一重工|主板A股|16.11|0.0523|0.8|1391234|218626.92|15.31|15.3|16.15|15.18\n600057|厦门象屿|主板A股|7.04|0.0203|0.14|182058|12663.3|6.9|6.91|7.04|6.79\n600022|山东钢铁|主板A股|1.34|0.0152|0.02|569189|7551.03|1.32|1.31|1.34|1.31\n600248|陕建股份|主板A股|4.19|0.022|0.09|576358|23821.62|4.1|4.1|4.19|4.04\n600018|上港集团|主板A股|5.81|0.0211|0.12|360538|20710.62|5.69|5.68|5.82|5.67\n900915|中路Ｂ股|主板B股|0.6|0.0119|0.01|1233|7.29|0.59|0.59|0.6|0.58\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600171|上海贝岭|主板A股|11.75|0.0701|0.77|87452|10070.27|10.98|11.17|11.77|11.14\n600021|上海电力|主板A股|9.2|0.0155|0.14|452488|41311.4|9.06|9.01|9.2|9.01\n600009|上海机场|主板A股|36.83|0.0115|0.42|94785|34643.87|36.41|36.25|36.85|35.98\n600170|上海建工|主板A股|2.42|0.0168|0.04|1115829|26652.33|2.38|2.37|2.42|2.35\n600073|上海梅林|主板A股|6.14|0.0372|0.22|94425|5729.06|5.92|5.92|6.14|5.92\n600104|上汽集团|主板A股|15.19|-0.0026|-0.04|251819|38044.09|15.23|15.17|15.23|15.02\n600201|生物股份|主板A股|8.86|0.0219|0.19|106198|9414.29|8.67|8.75|9|8.75\n600183|生益科技|主板A股|16.39|0.0473|0.74|215646|34947.29|15.65|15.8|16.41|15.8\n688718|唯赛勃|科创板|10.15|0.005|0.05|1826|183.08|10.1|10.26|10.26|9.9\n600241|时代万恒|主板A股|6.27|0.0736|0.43|84377|5189.57|5.84|5.84|6.37|5.84\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600008|首创环保|主板A股|2.92|0.0246|0.07|1024870|29585.98|2.85|2.85|2.92|2.84\n688033|天宜上佳|科创板|9.31|0.0054|0.05|51909|4771.17|9.26|9.22|9.37|9.05\n600039|四川路桥|主板A股|7.84|0.0169|0.13|305201|23758.82|7.71|7.75|7.84|7.65\n600128|苏豪弘业|主板A股|7.05|0.0173|0.12|176121|12340.58|6.93|6.68|7.18|6.67\n600129|太极集团|主板A股|33.15|0.0405|1.29|143436|46960.86|31.86|32|33.33|31.87\n600222|太龙药业|主板A股|4.97|0.0463|0.22|314122|15349.68|4.75|4.59|5.01|4.59\n600169|太原重工|主板A股|2.26|0.0415|0.09|261246|5806.66|2.17|2.16|2.26|2.16\n600089|特变电工|主板A股|14.7|0.0138|0.2|386696|56540.03|14.5|14.5|14.71|14.45\n600161|天坛生物|主板A股|28.45|0.0183|0.51|117481|33313.21|27.94|27.92|28.63|27.76\n688032|禾迈股份|科创板|242.26|0.0074|1.79|3731|8901.71|240.47|239.06|245.1|233.1\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600125|铁龙物流|主板A股|5.97|0.0474|0.27|306980|18045.57|5.7|5.73|5.97|5.72\n600100|同方股份|主板A股|6|0.0638|0.36|443864|26292.57|5.64|5.69|6.01|5.69\n600085|同仁堂|主板A股|41.87|0.0222|0.91|134784|55850.64|40.96|40.9|41.98|40.3\n688045|必易微|科创板|23.31|0.0082|0.19|2954|675.67|23.12|23.06|23.54|22.49\n600237|铜峰电子|主板A股|5.44|0.0968|0.48|244885|12947.78|4.96|4.96|5.46|4.96\n900938|海科B|主板B股|0.15|None|None|1786|2.64|0.15|0.15|0.15|0.15\n600012|皖通高速|主板A股|15.39|0.0315|0.47|91141|13728.32|14.92|14.91|15.43|14.68\n600063|皖维高新|主板A股|4.03|0.0333|0.13|217964|8688.43|3.9|3.93|4.03|3.92\n600055|万东医疗|主板A股|14.41|0.0404|0.56|54214|7729.02|13.85|14.2|14.42|13.96\n600246|万通发展|主板A股|7.79|0.0584|0.43|270876|20737.3|7.36|7.37|7.81|7.37\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12688055|龙腾光电|科创板|3.24|0.0093|0.03|21455|686.1|3.21|3.2|3.25|3.16\n600152|维科技术|主板A股|4.95|0.0465|0.22|147123|7198.91|4.73|4.63|4.98|4.61\n600300|维维股份|主板A股|2.72|0.0382|0.1|148025|3987.54|2.62|2.64|2.73|2.63\n688722|同益中|科创板|11.62|0.0096|0.11|6165|711.45|11.51|11.58|11.62|11.44\n600173|卧龙地产|主板A股|3.97|-0.0387|-0.16|266841|10514.39|4.13|3.81|4.02|3.8\n600058|五矿发展|主板A股|8.59|0.04|0.33|51080|4320.85|8.26|8.27|8.6|8.26\n600168|武汉控股|主板A股|6.01|0.0507|0.29|86396|5147.72|5.72|5.85|6.01|5.85\n900924|上工Ｂ股|主板B股|0.31|None|None|1906|5.91|0.31|0.31|0.31|0.31\n600211|西藏药业|主板A股|45.81|0.0171|0.77|35098|15933.22|45.04|45.3|45.87|44.3\n600162|香江控股|主板A股|1.41|0.0444|0.06|210041|2910.84|1.35|1.35|1.41|1.34\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600095|湘财股份|主板A股|6.72|0.0275|0.18|195636|12994.74|6.54|6.54|6.72|6.52\n688707|振华新材|科创板|13.7|0.0111|0.15|58405|7850.07|13.55|13.39|13.9|12.88\n600208|新湖中宝|主板A股|2.06|0.0249|0.05|425422|8679.84|2.01|2.01|2.06|2.01\n600075|新疆天业|主板A股|4.08|0.0175|0.07|131509|5331.53|4.01|4.03|4.12|4.01\n600255|鑫科材料|主板A股|1.8|0.0465|0.08|459153|8197.07|1.72|1.72|1.82|1.7\n688061|灿瑞科技|科创板|24.23|0.0138|0.33|2354|558.68|23.9|23.9|24.4|23.28\n600141|兴发集团|主板A股|20.22|0.0151|0.3|192387|38897.25|19.92|20.12|20.44|20\n600177|雅戈尔|主板A股|7.53|0.0121|0.09|259137|19356.47|7.44|7.43|7.56|7.37\n600108|亚盛集团|主板A股|2.58|0.032|0.08|161121|4117.8|2.5|2.5|2.58|2.5\n600213|亚星客车|主板A股|5.48|0.0379|0.2|106990|5851.26|5.28|4.99|5.6|4.99\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600188|兖矿能源|主板A股|25.62|0.0047|0.12|280310|71113.5|25.5|25.35|25.67|25.01\n688053|思科瑞|科创板|24.67|0.0169|0.41|4930|1185.55|24.26|24.7|24.7|23.33\n900937|华电B股|主板B股|0.12|-0.0242|None|5404|6.45|0.12|0.12|0.12|0.12\n600197|伊力特|主板A股|19.54|0.0145|0.28|43342|8424.19|19.26|19.3|19.59|19.26\n688036|传音控股|科创板|173.97|0.0195|3.32|11013|19105.74|170.65|172.69|174.93|171.01\n600105|永鼎股份|主板A股|4.28|0.0918|0.36|313215|13099.1|3.92|3.99|4.29|3.99\n600157|永泰能源|主板A股|1.34|0.0229|0.03|3291841|43903.8|1.31|1.31|1.35|1.31\n600206|有研新材|主板A股|10.71|0.0318|0.33|143646|15348.89|10.38|10.5|10.84|10.5\n600066|宇通客车|主板A股|24.12|0.0008|0.02|341287|81366.86|24.1|23.9|24.19|23.39\n600233|圆通速递|主板A股|16.26|0.0131|0.21|92945|15005.84|16.05|16.12|16.32|15.96\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12688700|东威科技|科创板|31.1|-0.0108|-0.34|12509|3841.79|31.44|31.44|31.45|30.1\n688766|普冉股份|科创板|91.51|-0.0107|-0.99|4063|3702.66|92.5|90.83|92.29|90.21\n600230|沧州大化|主板A股|10.42|0.0547|0.54|52294|5409.97|9.88|10|10.49|10\n688690|纳微科技|科创板|19.34|-0.0102|-0.2|9657|1850.78|19.54|19.43|19.56|18.9\n688709|成都华微|科创板|20.6|-0.0096|-0.2|20179|4119.35|20.8|20.51|20.78|20.26\n600229|城市传媒|主板A股|7.44|0.0629|0.44|167831|12320.28|7|7.21|7.45|7.17\n600227|赤天化|主板A股|1.69|0.012|0.02|319253|5370.53|1.67|1.65|1.72|1.63\n600035|楚天高速|主板A股|4.59|0.0268|0.12|227091|10301.9|4.47|4.49|4.59|4.46\n688695|中创股份|科创板|34.6|-0.0094|-0.33|4843|1660.99|34.93|35|35|34.07\n600193|创兴资源|主板A股|3.5|0.0574|0.19|107028|3667.11|3.31|3.07|3.53|3.07\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600203|福日电子|主板A股|6.6|0.1|0.6|605059|38643.54|6|6.01|6.6|6.01\n600223|福瑞达|主板A股|8.07|0.0399|0.31|103920|8224.14|7.76|7.7|8.07|7.7\n600166|福田汽车|主板A股|2.76|0.0615|0.16|1388481|37439.52|2.6|2.6|2.77|2.6\n600196|复星医药|主板A股|22.78|0.0192|0.43|73866|16744.02|22.35|22.34|22.8|22.34\n600037|歌华有线|主板A股|6.5|0.0383|0.24|111819|7221.91|6.26|6.35|6.53|6.33\n688052|纳芯微|科创板|85.19|-0.0071|-0.61|5237|4399.4|85.8|87|87|82.18\n600185|格力地产|主板A股|5.65|0.0348|0.19|127962|7178.49|5.46|5.51|5.68|5.51\n600059|古越龙山|主板A股|9|0.0274|0.24|96856|8630.52|8.76|8.85|9.01|8.8\n600067|冠城大通|主板A股|1.81|0.0462|0.08|178536|3203.2|1.73|1.73|1.82|1.73\n600251|冠农股份|主板A股|8.72|0.0283|0.24|115123|9985.33|8.48|8.58|8.74|8.58\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600184|光电股份|主板A股|8.89|0.0647|0.54|56579|4925.26|8.35|8.43|8.92|8.41\n600256|广汇能源|主板A股|7.87|0.0181|0.14|860204|66952.13|7.73|7.7|7.87|7.67\n600297|广汇汽车|主板A股|1.44|0.0435|0.06|552694|7859.93|1.38|1.38|1.45|1.38\n600098|广州发展|主板A股|6.72|0.003|0.02|296139|19703.48|6.7|6.75|6.76|6.56\n600236|桂冠电力|主板A股|6.34|0.0445|0.27|245089|15288.83|6.07|6.08|6.35|6.04\n600109|国金证券|主板A股|8.45|0.0205|0.17|240777|20143.13|8.28|8.27|8.45|8.24\n600061|国投资本|主板A股|6.28|0.0113|0.07|445239|27649.97|6.21|6.21|6.29|6.05\n600131|国网信通|主板A股|18.1|0.0017|0.03|182542|33086.55|18.07|18.23|18.45|17.9\n900921|丹科B股|主板B股|0.13|-0.0155|None|232|0.3|0.13|0.13|0.13|0.13\n600187|国中水务|主板A股|2.22|0.0472|0.1|229056|5024.46|2.12|2.13|2.22|2.13\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600202|哈空调|主板A股|4.46|0.0878|0.36|109165|4758.19|4.1|4.1|4.49|4.05\n688041|海光信息|科创板|79.48|-0.007|-0.56|44393|35069.1|80.04|79.23|79.58|78.48\n600221|海航控股|主板A股|1.35|0.015|0.02|807963|10866.26|1.33|1.33|1.36|1.33\n900923|百联Ｂ股|主板B股|0.47|-0.0042|None|247|1.17|0.47|0.48|0.48|0.47\n900917|海欣Ｂ股|主板B股|0.28|0.0109|None|315|0.87|0.27|0.27|0.28|0.27\n600238|海南椰岛|主板A股|7.56|0.0413|0.3|74110|5579.78|7.26|7.3|7.65|7.3\n600082|海泰发展|主板A股|2.32|0.0791|0.17|209991|4803.65|2.15|2.17|2.33|2.17\n900912|外高Ｂ股|主板B股|0.72|-0.0069|None|324|2.33|0.72|0.72|0.72|0.72\n600060|海信视像|主板A股|27.14|0.018|0.48|111119|29707.76|26.66|26.7|27.2|26.06\n600226|瀚叶股份|主板A股|2.51|None|None|195288|4879.86|2.51|2.51|2.53|2.48\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600126|杭钢股份|主板A股|5.18|0.0381|0.19|406699|20878.36|4.99|5.03|5.2|5\n600151|航天机电|主板A股|4.66|0.0591|0.26|180444|8287.86|4.4|4.43|4.67|4.43\n688719|爱科赛博|科创板|47.82|-0.0064|-0.31|1509|717.28|48.13|48.53|48.53|47.21\n688699|明微电子|科创板|26.86|-0.0063|-0.17|2889|767.98|27.03|27.45|27.5|26\n600155|华创云信|主板A股|6.74|0.0531|0.34|424011|28113.48|6.4|6.43|6.74|6.4\n900928|临港B股|主板B股|0.57|-0.0035|None|348|2|0.58|0.57|0.57|0.57\n600027|华电国际|主板A股|7.39|0.0221|0.16|627661|45540.34|7.23|7.17|7.4|7.08\n600011|华能国际|主板A股|10.05|0.0131|0.13|329137|32777.21|9.92|9.98|10.07|9.82\n600025|华能水电|主板A股|9.97|0.005|0.05|277634|27455.69|9.92|9.9|9.98|9.75\n688057|金达莱|科创板|10.58|-0.0056|-0.06|3678|387.22|10.64|10.54|10.7|10.41\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600062|华润双鹤|主板A股|20.52|-0.0058|-0.12|119170|24311.08|20.64|20.7|20.85|20\n600156|华升股份|主板A股|3.87|0.078|0.28|187400|7108.81|3.59|3.52|3.89|3.52\n600301|华锡有色|主板A股|14.29|0.0258|0.36|86703|12283.92|13.93|13.96|14.44|13.89\n600015|华夏银行|主板A股|6.77|0.0196|0.13|562177|37607.1|6.64|6.62|6.77|6.57\n900922|三毛B股|主板B股|0.41|-0.035|-0.01|401|1.67|0.43|0.43|0.43|0.41\n600191|华资实业|主板A股|4.8|0.1009|0.44|80184|3744.21|4.36|4.36|4.8|4.36\n600172|黄河旋风|主板A股|2.81|0.0684|0.18|240664|6661.17|2.63|2.65|2.81|2.65\n600054|黄山旅游|主板A股|12.86|0.0247|0.31|190324|24397.11|12.55|12.55|12.98|12.55\n900913|国新B股|主板B股|0.22|-0.0135|None|429|0.93|0.22|0.22|0.22|0.22\n688039|当虹科技|科创板|23.91|-0.005|-0.12|8822|2079.47|24.03|24|24.02|23.27\n证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12688739|成大生物|科创板|27.73|-0.0047|-0.13|3140|868.95|27.86|27.86|27.86|27.51\n600153|建发股份|主板A股|10.4|0.001|0.01|654694|67423.2|10.39|10.3|10.41|10.15\n600200|江苏吴中|主板A股|10.68|0.0299|0.31|492744|52950.65|10.37|10.55|11|10.55\n600220|江苏阳光|主板A股|1.63|0.0654|0.1|140903|2271.57|1.53|1.55|1.63|1.54\n688056|莱伯泰科|科创板|21.67|-0.0037|-0.08|1074|231.03|21.75|21.76|22.07|20.93\n600143|金发科技|主板A股|7.14|0.0439|0.3|177506|12516.34|6.84|6.94|7.16|6.91\n600080|金花股份|主板A股|6.84|0.0411|0.27|23028|1568.38|6.57|6.63|6.94|6.62\n600127|金健米业|主板A股|6.29|0.0345|0.21|168505|10531.92|6.08|6.08|6.36|6.07\n900909|华谊B股|主板B股|0.44|-0.0114|None|431|1.89|0.44|0.44|0.44|0.43\n600232|金鹰股份|主板A股|4.45|0.0801|0.33|108640|4764.53|4.12|4.16|4.48|4.15",
            "meta": {
                "object_id": "466DD9070E094C12A9C9B0317BBA155E",
                "doc_name": "证券数据mini",
                "ext_type": ".xlsx",
                "parent_path": "gns://测试数据/SHSF",
                "size": 35526,
                "doc_id": "gns://A123F3C38C7B48B09C5C24C06ABD098F/E675DA0E9FFD443389ADF9DAA7F13E88/466DD9070E094C12A9C9B0317BBA155E",
                "retrieve_source_type": "DOC_LIB",
                "slices": [
                    {
                        "score": 0.6385426748878069,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_24",
                        "no": 23,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600292|远达环保|主板A股|5.09|0.083|0.39|108100|5396.64|4.7|4.75|5.09|4.75\n600239|云南城投|主板A股|2.02|0.0466|0.09|192190|3846.55|1.93|1.93|2.03|1.93\n600096|云天化|主板A股|21.05|0.0248|0.51|458284|95004.73|20.54|20.58|21.1|20.3\n688031|星环科技-U|科创板|41.27|0.0223|0.9|10573|4248.66|40.37|40.8|41.27|39.12\n600192|长城电工|主板A股|4.08|0.0382|0.15|126023|5080.81|3.93|3.8|4.17|3.75\n600148|长春一东|主板A股|12.3|0.0789|0.9|39566|4790.29|11.4|11.44|12.35|11.44\n688037|芯源微|科创板|106.97|0.0286|2.97|28120|30271.4|104|103.01|110.99|103.01\n600119|长江投资|主板A股|6.37|0.046|0.28|174318|10951.59|6.09|5.91|6.45|5.91\n600036|招商银行|主板A股|33.3|0.0168|0.55|948212|313120.21|32.75|32.69|33.49|32.47\n600120|浙江东方|主板A股|3.74|0.0275|0.1|220834|8172.76|3.64|3.65|3.74|3.65",
                        "pages": [1],
                    },
                    {
                        "score": -1.151220488151004,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_25",
                        "no": 24,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600113|浙江东日|主板A股|7.37|0.0728|0.5|74802|5449.74|6.87|7.1|7.43|6.98\n600032|浙江新能|主板A股|7.34|0.0715|0.49|134898|9669.34|6.85|6.9|7.35|6.88\n600216|浙江医药|主板A股|9.33|0.0021|0.02|161731|15023.06|9.31|9.32|9.43|9.17\n600023|浙能电力|主板A股|6.66|0.0076|0.05|474603|31358.38|6.61|6.6|6.67|6.51\n688058|宝兰德|科创板|31.78|0.0332|1.02|2529|786.81|30.76|31.3|32.02|30.4\n600121|郑州煤电|主板A股|3.59|0.0346|0.12|258447|9210.14|3.47|3.4|3.65|3.4\n600072|中船科技|主板A股|16.09|0.0301|0.47|244737|38870.16|15.62|15.42|16.09|15.25\n688691|灿芯股份|科创板|48.13|0.0351|1.63|25877|12015.26|46.5|46.06|48.5|44.88\n600150|中国船舶|主板A股|39.37|0.0189|0.73|463410|180157.45|38.64|38.48|39.42|37.65\n600115|中国东航|主板A股|3.5|0.0264|0.09|627325|21705.39|3.41|3.4|3.5|3.4",
                        "pages": [1],
                    },
                    {
                        "score": -0.38668936258675857,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_26",
                        "no": 25,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600007|中国国贸|主板A股|23.18|0.0198|0.45|35182|8082.85|22.73|22.52|23.27|22.48\n600176|中国巨石|主板A股|11.36|0.0216|0.24|837532|93862.79|11.12|11.07|11.44|10.95\n600050|中国联通|主板A股|4.82|0.019|0.09|3238613|153786.37|4.73|4.71|4.83|4.64\n600028|中国石化|主板A股|6.64|-0.006|-0.04|1910952|125816.72|6.68|6.64|6.65|6.48\n600118|中国卫星|主板A股|24.16|0.0203|0.48|106038|25464.21|23.68|23.69|24.27|23.66\n600056|中国医药|主板A股|11.31|0.0217|0.24|335536|37320.77|11.07|10.83|11.44|10.68\n600252|中恒集团|主板A股|2.27|0.0271|0.06|388597|8716.12|2.21|2.22|2.27|2.22\n688696|极米科技|科创板|83.76|0.0406|3.27|2756|2268.93|80.49|80.34|83.88|80.06\n900936|鄂资Ｂ股|主板B股|1.04|0.0146|0.02|12704|132.05|1.02|1.03|1.05|1.02\n600163|中闽能源|主板A股|4.42|0.0184|0.08|169756|7450.68|4.34|4.29|4.43|4.29",
                        "pages": [1],
                    },
                    {
                        "score": -0.5114994176877941,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_27",
                        "no": 26,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600195|中牧股份|主板A股|8.5|0.0316|0.26|122529|10375.52|8.24|8.33|8.57|8.32\n600138|中青旅|主板A股|12.06|0.0644|0.73|827017|97173.37|11.33|11.17|12.16|11.09\n600088|中视传媒|主板A股|22.15|0.0518|1.09|440837|94258.91|21.06|21.23|22.24|19.89\n600158|中体产业|主板A股|8.33|0.0518|0.41|156896|12875.3|7.92|7.99|8.34|7.97\n600084|中信尼雅|主板A股|6|0.0714|0.4|50280|2980.99|5.6|5.7|6.1|5.69\n600030|中信证券|主板A股|18.1|0.0267|0.47|1205475|214569.53|17.63|17.58|18.11|17.45\n688697|纽威数控|科创板|19.59|0.0437|0.82|25365|4887.22|18.77|18.85|19.87|18.61\n600020|中原高速|主板A股|3.89|0.0346|0.13|224542|8634.3|3.76|3.79|3.92|3.78\n600026|中远海能|主板A股|16.22|0.0253|0.4|246187|39418.21|15.82|15.8|16.22|15.52\n600217|中再资环|主板A股|4.7|0.0586|0.26|184423|8524.93|4.44|4.47|4.7|4.47",
                        "pages": [1],
                    },
                    {
                        "score": 0.42606823051803583,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_28",
                        "no": 27,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600038|中直股份|主板A股|40.35|0.0652|2.47|133779|52881.7|37.88|38.28|40.39|38.07\n688059|华锐精密|科创板|64.17|0.0731|4.37|6508|4130.69|59.8|61.5|65.58|61.5\n600106|重庆路桥|主板A股|5.82|0.062|0.34|224940|12932.85|5.48|5.6|5.84|5.58\n600132|重庆啤酒|主板A股|65.5|0.0043|0.28|42703|27998.82|65.22|65.04|66.26|65.02\n688050|爱博医疗|科创板|140|0.1182|14.8|20072|27992.69|125.2|140|143|136.65\n600225|卓朗科技|主板A股|2.59|0.1021|0.24|213742|5406.92|2.35|2.42|2.59|2.4\n600210|紫江企业|主板A股|5.92|0.1004|0.54|1234603|72284.41|5.38|5.55|5.92|5.55",
                        "pages": [1],
                    },
                    {
                        "score": 0.46902589458228117,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_15",
                        "no": 14,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12688049|炬芯科技|科创板|24.64|0.0008|0.02|9003|2193.31|24.62|24.59|24.7|24.07\n600101|明星电力|主板A股|7.99|0.039|0.3|124096|9836.54|7.69|7.8|8.03|7.76\n688693|锴威特|科创板|22.35|0.0009|0.02|3255|712.77|22.33|22.32|22.45|21.52\n688046|药康生物|科创板|11.49|0.0009|0.01|11245|1279|11.48|11.59|11.59|11.17\n600029|南方航空|主板A股|5.51|0.0147|0.08|385190|21049.08|5.43|5.46|5.51|5.43\n600064|南京高科|主板A股|6.58|0.0092|0.06|205855|13434.53|6.52|6.5|6.58|6.47\n600250|南京商旅|主板A股|8.58|-0.0194|-0.17|309898|26924.82|8.75|7.92|9.12|7.92\n600219|南山铝业|主板A股|3.6|0.0286|0.1|1090280|38721.87|3.5|3.51|3.61|3.5\n600051|宁波联合|主板A股|5.77|0.0765|0.41|62509|3571.21|5.36|5.49|5.83|5.49\n688060|云涌科技|科创板|27.79|0.0011|0.03|1007|275.26|27.76|27.82|27.95|26.93",
                        "pages": [1],
                    },
                    {
                        "score": 0.02368911143578778,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_16",
                        "no": 15,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600110|诺德股份|主板A股|4.35|0.0741|0.3|247197|10576|4.05|4.1|4.35|4.1\n600215|派斯林|主板A股|8.32|0.0667|0.52|104055|8602.43|7.8|7.97|8.42|7.97\n600000|浦发银行|主板A股|7.34|0.011|0.08|431519|31410.21|7.26|7.26|7.35|7.18\n688711|宏微科技|科创板|25.85|0.0035|0.09|14747|3757.93|25.76|25.65|26.05|25.05\n600243|青海华鼎|主板A股|3.52|0.0414|0.14|277505|9532.63|3.38|3.05|3.55|3.05\n600103|青山纸业|主板A股|2.09|0.0556|0.11|339767|6982.44|1.98|1.98|2.09|1.98\n600218|全柴动力|主板A股|7.53|0.0897|0.62|126374|9321.07|6.91|7.07|7.53|7.03\n600189|泉阳泉|主板A股|7.78|0.0821|0.59|200507|15036.71|7.19|7.1|7.79|7.06\n600079|人福医药|主板A股|19.82|0.0269|0.52|254010|49700.73|19.3|19.3|19.85|18.98\n600017|日照港|主板A股|2.87|0.0287|0.08|356999|10112.96|2.79|2.79|2.87|2.79",
                        "pages": [1],
                    },
                    {
                        "score": -0.5840213702106652,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_17",
                        "no": 16,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600180|瑞茂通|主板A股|4.82|0.1005|0.44|175929|8243.77|4.38|4.45|4.82|4.44\n900911|金桥Ｂ股|主板B股|0.92|0.0033|None|1005|9.25|0.92|0.92|0.93|0.92\n600116|三峡水利|主板A股|7.27|0.0254|0.18|139591|10086.25|7.09|7.2|7.28|7.12\n600293|三峡新材|主板A股|2.68|0.0635|0.16|168752|4455.09|2.52|2.55|2.68|2.55\n600031|三一重工|主板A股|16.11|0.0523|0.8|1391234|218626.92|15.31|15.3|16.15|15.18\n600057|厦门象屿|主板A股|7.04|0.0203|0.14|182058|12663.3|6.9|6.91|7.04|6.79\n600022|山东钢铁|主板A股|1.34|0.0152|0.02|569189|7551.03|1.32|1.31|1.34|1.31\n600248|陕建股份|主板A股|4.19|0.022|0.09|576358|23821.62|4.1|4.1|4.19|4.04\n600018|上港集团|主板A股|5.81|0.0211|0.12|360538|20710.62|5.69|5.68|5.82|5.67\n900915|中路Ｂ股|主板B股|0.6|0.0119|0.01|1233|7.29|0.59|0.59|0.6|0.58",
                        "pages": [1],
                    },
                    {
                        "score": -0.7765118974476366,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_18",
                        "no": 17,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600171|上海贝岭|主板A股|11.75|0.0701|0.77|87452|10070.27|10.98|11.17|11.77|11.14\n600021|上海电力|主板A股|9.2|0.0155|0.14|452488|41311.4|9.06|9.01|9.2|9.01\n600009|上海机场|主板A股|36.83|0.0115|0.42|94785|34643.87|36.41|36.25|36.85|35.98\n600170|上海建工|主板A股|2.42|0.0168|0.04|1115829|26652.33|2.38|2.37|2.42|2.35\n600073|上海梅林|主板A股|6.14|0.0372|0.22|94425|5729.06|5.92|5.92|6.14|5.92\n600104|上汽集团|主板A股|15.19|-0.0026|-0.04|251819|38044.09|15.23|15.17|15.23|15.02\n600201|生物股份|主板A股|8.86|0.0219|0.19|106198|9414.29|8.67|8.75|9|8.75\n600183|生益科技|主板A股|16.39|0.0473|0.74|215646|34947.29|15.65|15.8|16.41|15.8\n688718|唯赛勃|科创板|10.15|0.005|0.05|1826|183.08|10.1|10.26|10.26|9.9\n600241|时代万恒|主板A股|6.27|0.0736|0.43|84377|5189.57|5.84|5.84|6.37|5.84",
                        "pages": [1],
                    },
                    {
                        "score": -0.5480743737083014,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_19",
                        "no": 18,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600008|首创环保|主板A股|2.92|0.0246|0.07|1024870|29585.98|2.85|2.85|2.92|2.84\n688033|天宜上佳|科创板|9.31|0.0054|0.05|51909|4771.17|9.26|9.22|9.37|9.05\n600039|四川路桥|主板A股|7.84|0.0169|0.13|305201|23758.82|7.71|7.75|7.84|7.65\n600128|苏豪弘业|主板A股|7.05|0.0173|0.12|176121|12340.58|6.93|6.68|7.18|6.67\n600129|太极集团|主板A股|33.15|0.0405|1.29|143436|46960.86|31.86|32|33.33|31.87\n600222|太龙药业|主板A股|4.97|0.0463|0.22|314122|15349.68|4.75|4.59|5.01|4.59\n600169|太原重工|主板A股|2.26|0.0415|0.09|261246|5806.66|2.17|2.16|2.26|2.16\n600089|特变电工|主板A股|14.7|0.0138|0.2|386696|56540.03|14.5|14.5|14.71|14.45\n600161|天坛生物|主板A股|28.45|0.0183|0.51|117481|33313.21|27.94|27.92|28.63|27.76\n688032|禾迈股份|科创板|242.26|0.0074|1.79|3731|8901.71|240.47|239.06|245.1|233.1",
                        "pages": [1],
                    },
                    {
                        "score": -0.18706190223024194,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_20",
                        "no": 19,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600125|铁龙物流|主板A股|5.97|0.0474|0.27|306980|18045.57|5.7|5.73|5.97|5.72\n600100|同方股份|主板A股|6|0.0638|0.36|443864|26292.57|5.64|5.69|6.01|5.69\n600085|同仁堂|主板A股|41.87|0.0222|0.91|134784|55850.64|40.96|40.9|41.98|40.3\n688045|必易微|科创板|23.31|0.0082|0.19|2954|675.67|23.12|23.06|23.54|22.49\n600237|铜峰电子|主板A股|5.44|0.0968|0.48|244885|12947.78|4.96|4.96|5.46|4.96\n900938|海科B|主板B股|0.15|None|None|1786|2.64|0.15|0.15|0.15|0.15\n600012|皖通高速|主板A股|15.39|0.0315|0.47|91141|13728.32|14.92|14.91|15.43|14.68\n600063|皖维高新|主板A股|4.03|0.0333|0.13|217964|8688.43|3.9|3.93|4.03|3.92\n600055|万东医疗|主板A股|14.41|0.0404|0.56|54214|7729.02|13.85|14.2|14.42|13.96\n600246|万通发展|主板A股|7.79|0.0584|0.43|270876|20737.3|7.36|7.37|7.81|7.37",
                        "pages": [1],
                    },
                    {
                        "score": -0.005718226788774927,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_21",
                        "no": 20,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12688055|龙腾光电|科创板|3.24|0.0093|0.03|21455|686.1|3.21|3.2|3.25|3.16\n600152|维科技术|主板A股|4.95|0.0465|0.22|147123|7198.91|4.73|4.63|4.98|4.61\n600300|维维股份|主板A股|2.72|0.0382|0.1|148025|3987.54|2.62|2.64|2.73|2.63\n688722|同益中|科创板|11.62|0.0096|0.11|6165|711.45|11.51|11.58|11.62|11.44\n600173|卧龙地产|主板A股|3.97|-0.0387|-0.16|266841|10514.39|4.13|3.81|4.02|3.8\n600058|五矿发展|主板A股|8.59|0.04|0.33|51080|4320.85|8.26|8.27|8.6|8.26\n600168|武汉控股|主板A股|6.01|0.0507|0.29|86396|5147.72|5.72|5.85|6.01|5.85\n900924|上工Ｂ股|主板B股|0.31|None|None|1906|5.91|0.31|0.31|0.31|0.31\n600211|西藏药业|主板A股|45.81|0.0171|0.77|35098|15933.22|45.04|45.3|45.87|44.3\n600162|香江控股|主板A股|1.41|0.0444|0.06|210041|2910.84|1.35|1.35|1.41|1.34",
                        "pages": [1],
                    },
                    {
                        "score": -0.09128792450967416,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_22",
                        "no": 21,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600095|湘财股份|主板A股|6.72|0.0275|0.18|195636|12994.74|6.54|6.54|6.72|6.52\n688707|振华新材|科创板|13.7|0.0111|0.15|58405|7850.07|13.55|13.39|13.9|12.88\n600208|新湖中宝|主板A股|2.06|0.0249|0.05|425422|8679.84|2.01|2.01|2.06|2.01\n600075|新疆天业|主板A股|4.08|0.0175|0.07|131509|5331.53|4.01|4.03|4.12|4.01\n600255|鑫科材料|主板A股|1.8|0.0465|0.08|459153|8197.07|1.72|1.72|1.82|1.7\n688061|灿瑞科技|科创板|24.23|0.0138|0.33|2354|558.68|23.9|23.9|24.4|23.28\n600141|兴发集团|主板A股|20.22|0.0151|0.3|192387|38897.25|19.92|20.12|20.44|20\n600177|雅戈尔|主板A股|7.53|0.0121|0.09|259137|19356.47|7.44|7.43|7.56|7.37\n600108|亚盛集团|主板A股|2.58|0.032|0.08|161121|4117.8|2.5|2.5|2.58|2.5\n600213|亚星客车|主板A股|5.48|0.0379|0.2|106990|5851.26|5.28|4.99|5.6|4.99",
                        "pages": [1],
                    },
                    {
                        "score": -1.048952971525167,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_23",
                        "no": 22,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600188|兖矿能源|主板A股|25.62|0.0047|0.12|280310|71113.5|25.5|25.35|25.67|25.01\n688053|思科瑞|科创板|24.67|0.0169|0.41|4930|1185.55|24.26|24.7|24.7|23.33\n900937|华电B股|主板B股|0.12|-0.0242|None|5404|6.45|0.12|0.12|0.12|0.12\n600197|伊力特|主板A股|19.54|0.0145|0.28|43342|8424.19|19.26|19.3|19.59|19.26\n688036|传音控股|科创板|173.97|0.0195|3.32|11013|19105.74|170.65|172.69|174.93|171.01\n600105|永鼎股份|主板A股|4.28|0.0918|0.36|313215|13099.1|3.92|3.99|4.29|3.99\n600157|永泰能源|主板A股|1.34|0.0229|0.03|3291841|43903.8|1.31|1.31|1.35|1.31\n600206|有研新材|主板A股|10.71|0.0318|0.33|143646|15348.89|10.38|10.5|10.84|10.5\n600066|宇通客车|主板A股|24.12|0.0008|0.02|341287|81366.86|24.1|23.9|24.19|23.39\n600233|圆通速递|主板A股|16.26|0.0131|0.21|92945|15005.84|16.05|16.12|16.32|15.96",
                        "pages": [1],
                    },
                    {
                        "score": 0.25101818338313564,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_3",
                        "no": 2,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12688700|东威科技|科创板|31.1|-0.0108|-0.34|12509|3841.79|31.44|31.44|31.45|30.1\n688766|普冉股份|科创板|91.51|-0.0107|-0.99|4063|3702.66|92.5|90.83|92.29|90.21\n600230|沧州大化|主板A股|10.42|0.0547|0.54|52294|5409.97|9.88|10|10.49|10\n688690|纳微科技|科创板|19.34|-0.0102|-0.2|9657|1850.78|19.54|19.43|19.56|18.9\n688709|成都华微|科创板|20.6|-0.0096|-0.2|20179|4119.35|20.8|20.51|20.78|20.26\n600229|城市传媒|主板A股|7.44|0.0629|0.44|167831|12320.28|7|7.21|7.45|7.17\n600227|赤天化|主板A股|1.69|0.012|0.02|319253|5370.53|1.67|1.65|1.72|1.63\n600035|楚天高速|主板A股|4.59|0.0268|0.12|227091|10301.9|4.47|4.49|4.59|4.46\n688695|中创股份|科创板|34.6|-0.0094|-0.33|4843|1660.99|34.93|35|35|34.07\n600193|创兴资源|主板A股|3.5|0.0574|0.19|107028|3667.11|3.31|3.07|3.53|3.07",
                        "pages": [1],
                    },
                    {
                        "score": 0.11582397447463438,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_6",
                        "no": 5,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600203|福日电子|主板A股|6.6|0.1|0.6|605059|38643.54|6|6.01|6.6|6.01\n600223|福瑞达|主板A股|8.07|0.0399|0.31|103920|8224.14|7.76|7.7|8.07|7.7\n600166|福田汽车|主板A股|2.76|0.0615|0.16|1388481|37439.52|2.6|2.6|2.77|2.6\n600196|复星医药|主板A股|22.78|0.0192|0.43|73866|16744.02|22.35|22.34|22.8|22.34\n600037|歌华有线|主板A股|6.5|0.0383|0.24|111819|7221.91|6.26|6.35|6.53|6.33\n688052|纳芯微|科创板|85.19|-0.0071|-0.61|5237|4399.4|85.8|87|87|82.18\n600185|格力地产|主板A股|5.65|0.0348|0.19|127962|7178.49|5.46|5.51|5.68|5.51\n600059|古越龙山|主板A股|9|0.0274|0.24|96856|8630.52|8.76|8.85|9.01|8.8\n600067|冠城大通|主板A股|1.81|0.0462|0.08|178536|3203.2|1.73|1.73|1.82|1.73\n600251|冠农股份|主板A股|8.72|0.0283|0.24|115123|9985.33|8.48|8.58|8.74|8.58",
                        "pages": [1],
                    },
                    {
                        "score": -0.6498986496669439,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_7",
                        "no": 6,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600184|光电股份|主板A股|8.89|0.0647|0.54|56579|4925.26|8.35|8.43|8.92|8.41\n600256|广汇能源|主板A股|7.87|0.0181|0.14|860204|66952.13|7.73|7.7|7.87|7.67\n600297|广汇汽车|主板A股|1.44|0.0435|0.06|552694|7859.93|1.38|1.38|1.45|1.38\n600098|广州发展|主板A股|6.72|0.003|0.02|296139|19703.48|6.7|6.75|6.76|6.56\n600236|桂冠电力|主板A股|6.34|0.0445|0.27|245089|15288.83|6.07|6.08|6.35|6.04\n600109|国金证券|主板A股|8.45|0.0205|0.17|240777|20143.13|8.28|8.27|8.45|8.24\n600061|国投资本|主板A股|6.28|0.0113|0.07|445239|27649.97|6.21|6.21|6.29|6.05\n600131|国网信通|主板A股|18.1|0.0017|0.03|182542|33086.55|18.07|18.23|18.45|17.9\n900921|丹科B股|主板B股|0.13|-0.0155|None|232|0.3|0.13|0.13|0.13|0.13\n600187|国中水务|主板A股|2.22|0.0472|0.1|229056|5024.46|2.12|2.13|2.22|2.13",
                        "pages": [1],
                    },
                    {
                        "score": -0.7119125648702198,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_8",
                        "no": 7,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600202|哈空调|主板A股|4.46|0.0878|0.36|109165|4758.19|4.1|4.1|4.49|4.05\n688041|海光信息|科创板|79.48|-0.007|-0.56|44393|35069.1|80.04|79.23|79.58|78.48\n600221|海航控股|主板A股|1.35|0.015|0.02|807963|10866.26|1.33|1.33|1.36|1.33\n900923|百联Ｂ股|主板B股|0.47|-0.0042|None|247|1.17|0.47|0.48|0.48|0.47\n900917|海欣Ｂ股|主板B股|0.28|0.0109|None|315|0.87|0.27|0.27|0.28|0.27\n600238|海南椰岛|主板A股|7.56|0.0413|0.3|74110|5579.78|7.26|7.3|7.65|7.3\n600082|海泰发展|主板A股|2.32|0.0791|0.17|209991|4803.65|2.15|2.17|2.33|2.17\n900912|外高Ｂ股|主板B股|0.72|-0.0069|None|324|2.33|0.72|0.72|0.72|0.72\n600060|海信视像|主板A股|27.14|0.018|0.48|111119|29707.76|26.66|26.7|27.2|26.06\n600226|瀚叶股份|主板A股|2.51|None|None|195288|4879.86|2.51|2.51|2.53|2.48",
                        "pages": [1],
                    },
                    {
                        "score": -1.3291640618891534,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_9",
                        "no": 8,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600126|杭钢股份|主板A股|5.18|0.0381|0.19|406699|20878.36|4.99|5.03|5.2|5\n600151|航天机电|主板A股|4.66|0.0591|0.26|180444|8287.86|4.4|4.43|4.67|4.43\n688719|爱科赛博|科创板|47.82|-0.0064|-0.31|1509|717.28|48.13|48.53|48.53|47.21\n688699|明微电子|科创板|26.86|-0.0063|-0.17|2889|767.98|27.03|27.45|27.5|26\n600155|华创云信|主板A股|6.74|0.0531|0.34|424011|28113.48|6.4|6.43|6.74|6.4\n900928|临港B股|主板B股|0.57|-0.0035|None|348|2|0.58|0.57|0.57|0.57\n600027|华电国际|主板A股|7.39|0.0221|0.16|627661|45540.34|7.23|7.17|7.4|7.08\n600011|华能国际|主板A股|10.05|0.0131|0.13|329137|32777.21|9.92|9.98|10.07|9.82\n600025|华能水电|主板A股|9.97|0.005|0.05|277634|27455.69|9.92|9.9|9.98|9.75\n688057|金达莱|科创板|10.58|-0.0056|-0.06|3678|387.22|10.64|10.54|10.7|10.41",
                        "pages": [1],
                    },
                    {
                        "score": -0.06150066109372121,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_10",
                        "no": 9,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12600062|华润双鹤|主板A股|20.52|-0.0058|-0.12|119170|24311.08|20.64|20.7|20.85|20\n600156|华升股份|主板A股|3.87|0.078|0.28|187400|7108.81|3.59|3.52|3.89|3.52\n600301|华锡有色|主板A股|14.29|0.0258|0.36|86703|12283.92|13.93|13.96|14.44|13.89\n600015|华夏银行|主板A股|6.77|0.0196|0.13|562177|37607.1|6.64|6.62|6.77|6.57\n900922|三毛B股|主板B股|0.41|-0.035|-0.01|401|1.67|0.43|0.43|0.43|0.41\n600191|华资实业|主板A股|4.8|0.1009|0.44|80184|3744.21|4.36|4.36|4.8|4.36\n600172|黄河旋风|主板A股|2.81|0.0684|0.18|240664|6661.17|2.63|2.65|2.81|2.65\n600054|黄山旅游|主板A股|12.86|0.0247|0.31|190324|24397.11|12.55|12.55|12.98|12.55\n900913|国新B股|主板B股|0.22|-0.0135|None|429|0.93|0.22|0.22|0.22|0.22\n688039|当虹科技|科创板|23.91|-0.005|-0.12|8822|2079.47|24.03|24|24.02|23.27",
                        "pages": [1],
                    },
                    {
                        "score": -0.29573842334783834,
                        "id": "466DD9070E094C12A9C9B0317BBA155E_11",
                        "no": 10,
                        "content": "证券代码|证券简称|类型|最新|涨跌幅|涨跌|成交量(手)|成交额(万元)|前收|开盘|最高|最低\n600136|*ST明诚|主板A股|1.3|-0.0441|-0.06|126135|1641.82|1.36|1.29|1.36|1.29\n600117|*ST西钢|主板A股|2.62|0.0195|0.05|30346|794.61|2.57|2.55|2.64|2.54\n600078|ST澄星|主板A股|7.13|0.0378|0.26|81423|5737.12|6.87|6.93|7.17|6.83\n600070|ST富润|主板A股|1.33|-0.05|-0.07|9074|120.68|1.4|1.33|1.33|1.33\n600165|ST宁科|主板A股|2.13|-0.0491|-0.11|3971|84.58|2.24|2.13|2.13|2.13\n600112|ST天成|主板A股|1.81|-0.0524|-0.1|10967|198.5|1.91|1.81|1.81|1.81\n600289|ST信通|主板A股|1.14|-0.0339|-0.04|108504|1222.89|1.18|1.12|1.18|1.12688739|成大生物|科创板|27.73|-0.0047|-0.13|3140|868.95|27.86|27.86|27.86|27.51\n600153|建发股份|主板A股|10.4|0.001|0.01|654694|67423.2|10.39|10.3|10.41|10.15\n600200|江苏吴中|主板A股|10.68|0.0299|0.31|492744|52950.65|10.37|10.55|11|10.55\n600220|江苏阳光|主板A股|1.63|0.0654|0.1|140903|2271.57|1.53|1.55|1.63|1.54\n688056|莱伯泰科|科创板|21.67|-0.0037|-0.08|1074|231.03|21.75|21.76|22.07|20.93\n600143|金发科技|主板A股|7.14|0.0439|0.3|177506|12516.34|6.84|6.94|7.16|6.91\n600080|金花股份|主板A股|6.84|0.0411|0.27|23028|1568.38|6.57|6.63|6.94|6.62\n600127|金健米业|主板A股|6.29|0.0345|0.21|168505|10531.92|6.08|6.08|6.36|6.07\n900909|华谊B股|主板B股|0.44|-0.0114|None|431|1.89|0.44|0.44|0.44|0.43\n600232|金鹰股份|主板A股|4.45|0.0801|0.33|108640|4764.53|4.12|4.16|4.48|4.15",
                        "pages": [1],
                    },
                ],
                "data_source": "doc",
                "score": 0.6385426748878069,
            },
        }
    ]
    out = _get_doc_retriever_output(text)
    print(out)
