package com.aishu.wf.core.common.exception;

/**
 * @description 自定义业务错误码枚举类
 * @author hanj
 */
public enum BizExceptionCodeEnum {
    /**
     * 参数不合法
     */
    A400001000(400001000, "参数不合法"),
    /**
     * 未授权或授权已过期
     */
    A401001000(401001000, "未授权或授权已过期"),
    /**
     * 服务内部错误
     */
    A500001000(500001000, "服务内部错误"),
    /**
     * 方法未实现
     */
    A501001000(501001000, "方法未实现"),
    /**
     * 获取文件异常或文件不存在
     */
    A50001101(500001101, "获取文件异常或文件不存在"),
    /**
     * 获取加签配置信息失败
     */
    A50001102(500001102, "获取加签配置信息失败"),
    /**
     * 超过加签最大次数
     */
    A50001103(500001103, "超过加签最大次数"),
    /**
     * 存在重复加签的用户
     */
    A50001104(500001104, "存在重复加签的用户"),
    /**
     * 同一审核员重复审核同一申请时，是否允许重复审核
     */
    A50001105(500001105, "同一审核员重复审核同一申请时，是否允许重复审核，加签失败"),
    /**
     * 获取退回配置信息失败
     */
    A50001106(500001106, "获取退回配置信息失败"),
    /**
     * 无审核权限
     */
    A401001101(401001101, "无审核权限"),
    /**
     * 密级不足
     */
    A401001102(401001102, "密级不足"),
    /**
     * 未获取到读取策略
     */
    A401001103(401001103, "未获取到读取策略"),
    /**
     * 未获取到流程定义
     */
    A404001001(404001001, "未获取到流程定义"),
    /**
     * 未获取到读取策略
     */
    A404002006(404002006, "请求的文件或目录不存在"),
    // 自定义错误码
    /**
     * 非法参数
     */
    A400057001(400057001, "非法参数"),
    /**
     * 审核意见不能为空
     */
    A400057002(400057002, "审核意见不能为空"),
    /**
     * 同级审核有审核员通过
     */
    A403057001(403057001, "当前环节审核员已通过，无须催办"),
    /**
     * 已催办
     */
    A403057002(403057002, "当前审核环节已催办，请稍后重试"),
    /**
     * 审核员非法
     */
    A403057003(403057003, "审核员不在当前环节内"),
    /**
     * 审核记录已完成
     */
    A403057004(403057004, "审核记录已失效或已审核完成"),
    /**
     * 转审开关关闭
     */
    A403057005(403057005, "转审开关关闭, 禁止转审操作"),
    /**
     * 转审人已存在转审列表
     */
    A403057006(403057006, "当前转审人已存在转审列表中"),
    /**
     * 转审人与被转审人相同
     */
    A403057007(403057007, "当前转审人与被转审人相同,无法转审"),
    /**
     * 转审人已在审核环节中
     */
    A403057008(403057008, "当前转审人已存在当前环节审核列表中"),
    /**
     * 超过转审最大次数
     */
    A403057009(403057009, "超过转审最大次数"),
    /**
     * 同一审核员重复审核同一申请时，是否允许重复审核
     */
    A403057010(403057010, "配置只需审核一次操作，不允许转审给已审核用户"),
    /**
     * 已有请求正在处理，请稍后重试
     */
    A403057011(403057011, "已有请求正在处理，请稍后重试"),
    /**
     * 文件权限不足
     */
    A403057012(403057012, "文件权限不足"),
    /**
     * 超过附件最大提交文件数
     */
    A403057013(403057013, "超过附件最大提交文件数"),
    /**
     * 非流程定义创建者
     */
    A403057014(403057014, "非流程定义创建者"),
    /**
     * 非流程定义创建者
     */
    A403057015(403057015, "退回开关未开启"),
    /**
     * 记录不存在
     */
    A404057001(404057001, "未获取到指定记录"),
    /**
     * 未获取到转审配置信息
     */
    A404057002(404057002, "未获取到转审配置信息"),
    /**
     * 未获取到邮件开关配置信息
     */
    A404057003(404057003, "未获取到邮件开关配置信息"),
    /**
     * 文件不存在
     */
    A404057004(404057004, "文件不存在"),
    /**
     * 获取转审配置信息失败
     */
    A500057001(500057001, "获取转审配置信息失败");

    private final Integer code;

    private final String message;

    BizExceptionCodeEnum(Integer code, String message) {
        this.code = code;
        this.message = message;
    }

    public Integer getCode() {
        return code;
    }

    public String getMessage() {
        return message;
    }

}
