
prompt_generate_question = """
你是一个问题生成专家，帮我根据提供的schema和nGQL图谱查询语句，生成1个真实用户的问题。
schema = {schema}

要求：
1、你面向的是智能问答场景，必须模拟真实用户的提问方式生成问题。
2、生成的问题和提供的nGQL语句是对应的，也就是说生成的问题可以使用提供的nGQL语句查询得到答案。
3、先解释提供的nGQL语句的详细解释，比如可以包含查询目标、节点和关系描述、或过滤条件、或返回结果的结构、或匹配逻辑、或结果排序和分页、或特殊语法解析、或查询的限制和假设、或查询的潜在含义和业务背景等信息。
4、最后根据nGQL语句的详细解释生成问题，生成的问题查询范围一定和nGQL RETURN中查询目标和返回结果保持一致，不多也不少。
5、只需要生成nGQL语句解释和问题，不要输出其他的内容。

nGQL：{query}

输出格式如下：
nGQL语句解释：
生成的问题：
"""

prompt_generate_user_question = """
你是一个问题生成专家，帮我根据提供的示例问题和nGQL图谱查询语句，生成1个真实用户的相似问题。

要求：
1、你面向的是智能问答场景，必须模拟真实用户的提问方式生成问题。
2、已经给你提供了真实的question和nGQL示例作为参考，请仿照示例的结构生成简洁的问题。
3、生成的问题和提供的nGQL语句是对应的，也就是说生成的问题可以使用提供的nGQL语句查询得到答案。
4、生成的问题查询范围一定和nGQL RETURN中查询目标和返回结果保持一致，不多也不少。
5、只需要生成问题，不要输出其他的内容。

示例：
nGQL：{answer}
question：{question}


新的nGQL：{new_answer}
question：


"""